### Import Pandas

In [1]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [ ]:
!pip install pandas

In [1]:
import pandas as pd

In Jupyter Notebook, you can press 'A' to insert cell above and press 'B' to insert a cell below the current cell.

A lot of times, your data may contain strings and mixed data. And we saw that Numpy cannot handle mixed type of data. Generally, people don't really use NumPy for string manipulation. In pandas, you will be able to work with non-numeric data types and we will be able to work with different types of data within the same table. \

Download the data
Let's create a folder to save the data files. Go to https://www.kaggle.com/codingelements . Look for gapminder dataset, and click on it to go the page. We can say the data is stored in the '.csv' file. Data headers and some statistics for every columns are also given. Download this file and store in the data folder that you have just created.

### Read the CSV file

In [2]:
df = pd.read_csv('data/gapminder.csv')

Save this data in a variable. In pandas, the table is called a data-frame, and print first 5 rows using `.head()`. Bottom rows can be printed using `.tail()`.

In [3]:
df = pd.read_csv('data/gapminder.csv')
df.head(5) # prints only the top-5 rows

       country continent  year  lifeExp  population   gdpPerCap
0  Afghanistan      Asia  1952   28.801     8425333  779.445314
1  Afghanistan      Asia  1957   30.332     9240934  820.853030
2  Afghanistan      Asia  1962   31.997    10267083  853.100710
3  Afghanistan      Asia  1967   34.020    11537966  836.197138
4  Afghanistan      Asia  1972   36.088    13079460  739.981106

### Check the type of dataframe

In [4]:
type(df)

pandas.core.frame.DataFrame

### Dimension of a dataframe

In [5]:
df.shape

(1704, 6)

### Get the basic info of the dataframe

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   continent   1704 non-null   object
 2   year        1704 non-null   int64
 3   lifeExp     1704 non-null   float64
 4   population  1704 non-null   int64
 5   gdpPerCap   1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

### Statistical overview of the dataframe

In [7]:
df.describe()

             year      lifeExp    population      gdpPerCap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165877
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846989
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

The statistical overview is only possible for numerical columns.

### Get the column names

In [8]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'population', 'gdpPerCap'], dtype='object')

In [9]:
df.keys()

Index(['country', 'continent', 'year', 'lifeExp', 'population', 'gdpPerCap'], dtype='object')

### Access column values

In [10]:
df['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

#### Access multiple values of multiple column

In [11]:
df[['country', 'lifeExp']]

          country  lifeExp
0     Afghanistan   28.801
1     Afghanistan   30.332
2     Afghanistan   31.997
3     Afghanistan   34.020
4     Afghanistan   36.088
...           ...      ...
1699     Zimbabwe   62.351
1700     Zimbabwe   60.377
1701     Zimbabwe   46.809
1702     Zimbabwe   39.989
1703     Zimbabwe   43.487

[1704 rows x 2 columns]

In [12]:
df.columns[0]

'country'

### Change the name of the column

In [13]:
df.rename(columns={"country":"Country"}, inplace=True)

In [14]:
df.columns

Index(['Country', 'continent', 'year', 'lifeExp', 'population', 'gdpPerCap'], dtype='object')

In [15]:
df.index[[2, 3]]

Int64Index([2, 3], dtype='int64')

### Drop row(s) or column(s) using label and index

Note that by default, the axis will be 0.

In [16]:
df.drop(labels="continent", axis=1)

          Country  year  lifeExp  population   gdpPerCap
0     Afghanistan  1952   28.801     8425333  779.445314
1     Afghanistan  1957   30.332     9240934  820.853030
2     Afghanistan  1962   31.997    10267083  853.100710
3     Afghanistan  1967   34.020    11537966  836.197138
4     Afghanistan  1972   36.088    13079460  739.981106
...           ...   ...      ...         ...         ...
1699     Zimbabwe  1987   62.351     9216418  706.157306
1700     Zimbabwe  1992   60.377    10704340  693.420786
1701     Zimbabwe  1997   46.809    11404948  792.449960
1702     Zimbabwe  2002   39.989    11926563  672.038623
1703     Zimbabwe  2007   43.487    12311143  469.709298

[1704 rows x 5 columns]

`labels` can be of row or columns, hence axis is a necessary argument if labels is used.

In [17]:
df.drop(index = df.index[[2,3]]) # drops some rows

          Country continent  year  lifeExp  population   gdpPerCap
0     Afghanistan      Asia  1952   28.801     8425333  779.445314
1     Afghanistan      Asia  1957   30.332     9240934  820.853030
4     Afghanistan      Asia  1972   36.088    13079460  739.981106
5     Afghanistan      Asia  1977   38.438    14880372  786.113360
6     Afghanistan      Asia  1982   39.854    12881816  978.011439
...           ...       ...   ...      ...         ...         ...
1699     Zimbabwe    Africa  1987   62.351     9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377    10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809    11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989    11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487    12311143  469.709298

[1702 rows x 6 columns]

If we re-run this code, this won't give an error because the column and rows were not dropped from the original data-frame. We will have use argument `inplace=True` for that.

### Rows

Remember that iloc  works with indexes and loc  works with the labels.

In [18]:
df.iloc[700] # gives the row at index number 700

Country           India
continent          Asia
year               1972
lifeExp          50.651
population    567000000
gdpPerCap       724.033
Name: 700, dtype: object

In [19]:
df.iloc[[1, 10, 100]] # we always have to pass it as a list if we are acessing multiple rows or columns

         Country continent  year  lifeExp  population   gdpPerCap
1    Afghanistan      Asia  1957   30.332     9240934  820.853030
10   Afghanistan      Asia  2002   42.129    25268405  726.734055
100   Bangladesh      Asia  1972   45.252    70759295  630.233627

In [20]:
df.iloc[-1] # gives us the last row

Country       Zimbabwe
continent       Africa
year              2007
lifeExp         43.487
population    12311143
gdpPerCap      469.709
Name: 1703, dtype: object

In [21]:
df.loc[-1] # do you think that this will work

KeyError: -1

This didn't work because `loc` expects label corresponding to the row instead of index.

In [22]:
df.iloc[1:10]

       Country continent  year  lifeExp  population   gdpPerCap
1  Afghanistan      Asia  1957   30.332     9240934  820.853030
2  Afghanistan      Asia  1962   31.997    10267083  853.100710
3  Afghanistan      Asia  1967   34.020    11537966  836.197138
4  Afghanistan      Asia  1972   36.088    13079460  739.981106
5  Afghanistan      Asia  1977   38.438    14880372  786.113360
6  Afghanistan      Asia  1982   39.854    12881816  978.011439
7  Afghanistan      Asia  1987   40.822    13867957  852.395945
8  Afghanistan      Asia  1992   41.674    16317921  649.341395
9  Afghanistan      Asia  1997   41.763    22227415  635.341351

In [23]:
df.loc[1:10] # ending point is also included when we mention the labels

        Country continent  year  lifeExp  population   gdpPerCap
1   Afghanistan      Asia  1957   30.332     9240934  820.853030
2   Afghanistan      Asia  1962   31.997    10267083  853.100710
3   Afghanistan      Asia  1967   34.020    11537966  836.197138
4   Afghanistan      Asia  1972   36.088    13079460  739.981106
5   Afghanistan      Asia  1977   38.438    14880372  786.113360
6   Afghanistan      Asia  1982   39.854    12881816  978.011439
7   Afghanistan      Asia  1987   40.822    13867957  852.395945
8   Afghanistan      Asia  1992   41.674    16317921  649.341395
9   Afghanistan      Asia  1997   41.763    22227415  635.341351
10  Afghanistan      Asia  2002   42.129    25268405  726.734055

### Mixed Splicing

In [24]:
df.iloc[1:5, 1:4] # we can use simple lists containing indexes also

  continent  year  lifeExp
1      Asia  1957   30.332
2      Asia  1962   31.997
3      Asia  1967   34.020
4      Asia  1972   36.088

In [25]:
# df.loc[1:5, 1:4] # this won't work, column names are not numeric
df.loc[1:5, ['continent', 'Country', 'lifeExp']]

  continent      Country  lifeExp
1      Asia  Afghanistan   30.332
2      Asia  Afghanistan   31.997
3      Asia  Afghanistan   34.020
4      Asia  Afghanistan   36.088
5      Asia  Afghanistan   38.438

### Series

Single dimensional lists in pandas are called Series.

In [26]:
r = df.loc[0]
print(type(r)) # it will be a series
c = df['Country']
print(type(c))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [27]:
le = df['lifeExp'] # this works because 'lifeExp' is a key
m = le.mean()
m

59.474439366197174

Similar to NumPy, when we do an operation on the Series, it gets broad-casted.

In [28]:
le > 59

0       False
1       False
2       False
3       False
4       False
        ...
1699     True
1700     True
1701    False
1702    False
1703    False
Name: lifeExp, Length: 1704, dtype: bool

In [29]:
df.loc[df['lifeExp'] > 59] # returns rows with lifeExp > 59

          Country continent  year  lifeExp  population    gdpPerCap
13        Albania    Europe  1957   59.280     1476505  1942.284244
14        Albania    Europe  1962   64.820     1728137  2312.888958
15        Albania    Europe  1967   66.220     1984060  2760.196931
16        Albania    Europe  1972   67.690     2263554  3313.422188
17        Albania    Europe  1977   68.930     2509048  3533.003910
...           ...       ...   ...      ...         ...          ...
1678  Yemen, Rep.      Asia  2002   60.308    18701257  2234.820827
1679  Yemen, Rep.      Asia  2007   62.698    22211743  2280.769906
1698     Zimbabwe    Africa  1982   60.363     7636524   788.855041
1699     Zimbabwe    Africa  1987   62.351     9216418   706.157306
1700     Zimbabwe    Africa  1992   60.377    10704340   693.420786

[911 rows x 6 columns]

In [30]:
df.loc[df.lifeExp > m, ['Country', 'lifeExp']] # returns rows with lifExp greater than mean

          Country  lifeExp
14        Albania   64.820
15        Albania   66.220
16        Albania   67.690
17        Albania   68.930
18        Albania   70.420
...           ...      ...
1678  Yemen, Rep.   60.308
1679  Yemen, Rep.   62.698
1698     Zimbabwe   60.363
1699     Zimbabwe   62.351
1700     Zimbabwe   60.377

[895 rows x 2 columns]

### Multiple conditions - similar to SQL queries

In [31]:
# df.loc[df.lifeExp < 60 & df.lifeExp < 62] # this will give an error
df.loc[(df.lifeExp < 60) & (df.lifeExp < 62)]

          Country continent  year  lifeExp  population   gdpPerCap
0     Afghanistan      Asia  1952   28.801     8425333  779.445314
1     Afghanistan      Asia  1957   30.332     9240934  820.853030
2     Afghanistan      Asia  1962   31.997    10267083  853.100710
3     Afghanistan      Asia  1967   34.020    11537966  836.197138
4     Afghanistan      Asia  1972   36.088    13079460  739.981106
...           ...       ...   ...      ...         ...         ...
1696     Zimbabwe    Africa  1972   55.635     5861135  799.362176
1697     Zimbabwe    Africa  1977   57.674     6642107  685.587682
1701     Zimbabwe    Africa  1997   46.809    11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989    11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487    12311143  469.709298

[827 rows x 6 columns]

### Multiple conditions on rows with selection of certain columns

In [32]:
df.loc[(df.lifeExp < 30) | (df.lifeExp < 62), ['year', 'Country']]

      year      Country
0     1952  Afghanistan
1     1957  Afghanistan
2     1962  Afghanistan
3     1967  Afghanistan
4     1972  Afghanistan
...    ...          ...
1698  1982     Zimbabwe
1700  1992     Zimbabwe
1701  1997     Zimbabwe
1702  2002     Zimbabwe
1703  2007     Zimbabwe

[891 rows x 2 columns]

### Filters based on strings

In [33]:
df.loc[df.Country=="Zimbabwe"]

       Country continent  year  lifeExp  population   gdpPerCap
1692  Zimbabwe    Africa  1952   48.451     3080907  406.884115
1693  Zimbabwe    Africa  1957   50.469     3646340  518.764268
1694  Zimbabwe    Africa  1962   52.358     4277736  527.272182
1695  Zimbabwe    Africa  1967   53.995     4995432  569.795071
1696  Zimbabwe    Africa  1972   55.635     5861135  799.362176
1697  Zimbabwe    Africa  1977   57.674     6642107  685.587682
1698  Zimbabwe    Africa  1982   60.363     7636524  788.855041
1699  Zimbabwe    Africa  1987   62.351     9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377    10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809    11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989    11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487    12311143  469.709298

In [34]:
df.loc[(df.Country=="Kenya") | (df.Country=="Egypt")]

    Country continent  year  lifeExp  population    gdpPerCap
456   Egypt    Africa  1952   41.893    22223309  1418.822445
457   Egypt    Africa  1957   44.444    25009741  1458.915272
458   Egypt    Africa  1962   46.992    28173309  1693.335853
459   Egypt    Africa  1967   49.293    31681188  1814.880728
460   Egypt    Africa  1972   51.137    34807417  2024.008147
461   Egypt    Africa  1977   53.319    38783863  2785.493582
462   Egypt    Africa  1982   56.006    45681811  3503.729636
463   Egypt    Africa  1987   59.797    52799062  3885.460710
464   Egypt    Africa  1992   63.674    59402198  3794.755195
465   Egypt    Africa  1997   67.217    66134291  4173.181797
466   Egypt    Africa  2002   69.806    73312559  4754.604414
467   Egypt    Africa  2007   71.338    80264543  5581.180998
816   Kenya    Africa  1952   42.270     6464046   853.540919
817   Kenya    Africa  1957   44.686     7454779   944.438315
818   Kenya    Africa  1962   47.949     8678557   896.966373
819   Kenya    Africa  1967   50.654    10191512  1056.736457
820   Kenya    Africa  1972   53.559    12044785  1222.359968
821   Kenya    Africa  1977   56.155    14500404  1267.613204
822   Kenya    Africa  1982   58.766    17661452  1348.225791
823   Kenya    Africa  1987   59.339    21198082  1361.936856
824   Kenya    Africa  1992   59.285    25020539  1341.921721
825   Kenya    Africa  1997   54.407    28263827  1360.485021
826   Kenya    Africa  2002   50.992    31386842  1287.514732
827   Kenya    Africa  2007   54.110    35610177  1463.249282

In [35]:
df.loc[df.Country>"Nigeria"] # strings > than Nigeria

       Country continent  year  lifeExp  population     gdpPerCap
1140    Norway    Europe  1952   72.670     3327728  10095.421720
1141    Norway    Europe  1957   73.440     3491938  11653.973040
1142    Norway    Europe  1962   73.470     3638919  13450.401510
1143    Norway    Europe  1967   74.080     3786019  16361.876470
1144    Norway    Europe  1972   74.340     3933004  18965.055510
...        ...       ...   ...      ...         ...           ...
1699  Zimbabwe    Africa  1987   62.351     9216418    706.157306
1700  Zimbabwe    Africa  1992   60.377    10704340    693.420786
1701  Zimbabwe    Africa  1997   46.809    11404948    792.449960
1702  Zimbabwe    Africa  2002   39.989    11926563    672.038623
1703  Zimbabwe    Africa  2007   43.487    12311143    469.709298

[564 rows x 6 columns]

### Grouping

In [36]:
df.groupby('year')['lifeExp'].mean() # gives the mean for each group, can specify multiple columns here

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

But notice that 'year' and other labels appear to be different line across the table. The result is actually a Pandas Series. Resetting index will make the table look normal again. When  we reset the index, the old indexes gets added as a column, and new indexes starting from 0 are assigned to the rows.

In [37]:
df.groupby('year')['gdpPerCap'].mean().reset_index()

    year     gdpPerCap
0   1952   3725.276046
1   1957   4299.408345
2   1962   4725.812342
3   1967   5483.653047
4   1972   6770.082815
5   1977   7313.166421
6   1982   7518.901673
7   1987   7900.920218
8   1992   8158.608521
9   1997   9090.175363
10  2002   9917.848365
11  2007  11680.071820

### Sorting

In [38]:
df.sort_values(['year', 'lifeExp'])
df.sort_values(['year', 'lifeExp'], ascending=[True, False])

           Country continent  year  lifeExp  population     gdpPerCap
1140        Norway    Europe  1952   72.670     3327728  10095.421720
684        Iceland    Europe  1952   72.490      147962   7267.688428
1080   Netherlands    Europe  1952   72.130    10381988   8941.571858
1464        Sweden    Europe  1952   71.860     7124673   8527.844662
408        Denmark    Europe  1952   70.780     4334000   9692.385245
...            ...       ...   ...      ...         ...           ...
887        Lesotho    Africa  2007   42.592     2012649   1569.331442
1355  Sierra Leone    Africa  2007   42.568     6144562    862.540756
1691        Zambia    Africa  2007   42.384    11746035   1271.211593
1043    Mozambique    Africa  2007   42.082    19951656    823.685621
1463     Swaziland    Africa  2007   39.613     1133066   4513.480643

[1704 rows x 6 columns]

### Create own data

In [39]:
pd.Series([10, 20, 30])

0    10
1    20
2    30
dtype: int64

In [40]:
pd.Series(['a', 'b', 'c'])

0    a
1    b
2    c
dtype: object

### Create a dataframe

In [41]:
pd.DataFrame([[10, 20], [30, 40]], columns=['A', 'B']) # passing data as list of rows

    A   B
0  10  20
1  30  40

In [42]:
pd.DataFrame({'A':[10, 30], 'B':[20, 40]}) # give the data column-wise

    A   B
0  10  20
1  30  40

### Concatenate the data

In [43]:
a = pd.DataFrame([[10, 20], [30, 40]], columns=['A', 'B'])
b = pd.DataFrame({'A':[50, 70], 'C':[60, 80]})
pd.concat([a, b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  50   NaN  60.0
1  70   NaN  80.0

Notice that gives you a warning because it can be probably detect that this is not what you intent to do.

Also, if you want to do the concatenation across a different axis, you can mention it.

In [44]:
pd.concat([a, b], axis=1)

    A   B   A   C
0  10  20  50  60
1  30  40  70  80

### Missing Values

Download the data Let's create a folder to save the data files. Go to https://www.kaggle.com/codingelements . Look for disease dataset, and click on it to go the page. We can say the data is stored in the '.csv' file. Data headers and some statistics for every columns are also given. Download this file and store in the `data` folder that you have just created.

In [45]:
disease = pd.read_csv('data/disease.csv')
disease.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_Nigeria,Cases_Senegal,Cases_UnitedKingdom,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedKingdom,Deaths_Mali
0,7/22/2014,122,2770.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,NaN,NaN,NaN,NaN
1,7/21/2014,121,2771.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,NaN,NaN,NaN,NaN
2,7/20/2014,120,2765.0,8165.0,NaN,NaN,NaN,NaN,1767.0,3496.0,NaN,NaN,NaN,NaN
3,7/19/2014,119,NaN,8156.0,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN
4,7/18/2014,118,2730.0,8115.0,NaN,NaN,NaN,NaN,1739.0,3471.0,NaN,NaN,NaN,NaN

In [46]:
from numpy import NaN, NAN, nan
nan == nan # can you compare two infinity values
pd.isnull(nan)

True

What if you have justone or very few rows which has missing data, you can simply remove those rows.

In [47]:
disease['Cases_Guinea'].value_counts(dropna=False).head()

NaN      29
86.0      3
495.0     2
112.0     2
390.0     2
Name: Cases_Guinea, dtype: int64

In [48]:
disease['Cases_Guinea'].unique()

array([2770., 2771., 2765.,   nan, 2730., 2706., 2695., 2630., 2597.,
       2571., 2416., 2292., 2164., 2134., 2047., 1971., 1919., 1878.,
       1770., 1731., 1667., 1906., 1553., 1540., 1519., 1472., 1350.,
       1298., 1199., 1157., 1074., 1022., 1008.,  942.,  936.,  899.,
        861.,  812.,  771.,  648.,  607.,  579.,  543.,  519.,  510.,
        506.,  495.,  485.,  472.,  460.,  427.,  415.,  410.,  411.,
        406.,  409.,  408.,  412.,  413.,  390.,  398.,  351.,  344.,
        328.,  291.,  281.,  258.,  248.,  233.,  236.,  235.,  231.,
        226.,  224.,  218.,  208.,  203.,  197.,  168.,  159.,  158.,
        151.,  143.,  127.,  122.,  112.,  103.,   86.,   49.])

In [49]:
disease['Cases_Guinea'].nunique(dropna=False) # you have to specifically mention it

89

#### Replace the value with mean

In [50]:
avg = disease['Cases_Guinea'].mean() # neglects nans
disease['Cases_Guinea'].replace(to_replace=NaN, value=avg) # does it update the data?

0      2770.000000
1      2771.000000
2      2765.000000
3       911.021505
4      2730.000000
          ...
117     103.000000
118      86.000000
119      86.000000
120      86.000000
121      49.000000
Name: Cases_Guinea, Length: 122, dtype: float64

#### Backward and Forward fill approach

In [51]:
disease = disease.fillna(method="ffill")
disease = disease.fillna(method="bfill")
disease.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_Nigeria,Cases_Senegal,Cases_UnitedKingdom,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedKingdom,Deaths_Mali
0,7/22/2014,122,2770.0,8165.0,20.0,1.0,4.0,7.0,1786.0,3496.0,8.0,0.0,1.0,6.0
1,7/21/2014,121,2771.0,8165.0,20.0,1.0,4.0,7.0,1781.0,3496.0,8.0,0.0,1.0,6.0
2,7/20/2014,120,2765.0,8165.0,20.0,1.0,4.0,7.0,1767.0,3496.0,8.0,0.0,1.0,6.0
3,7/19/2014,119,2765.0,8156.0,20.0,1.0,4.0,7.0,1767.0,3496.0,8.0,0.0,1.0,6.0
4,7/18/2014,118,2730.0,8115.0,20.0,1.0,4.0,7.0,1739.0,3471.0,8.0,0.0,1.0,6.0

### Restructure data

For this, we will downloading new data, the ‘weather’ data from https://www.kaggle.com/codingelements. Confirm that csv file is there in the weather folder.

In [56]:
weather = pd.read_csv('data/weather.csv')
weather.head()

,year,month,element,day1,day2,day3,day4,day5,day6,day7,...,day22,day23,day24,day25,day26,day27,day28,day29,day30,day31
0,2018,1,max,17.573016,19.796815,22.412495,17.813163,20.165825,17.060539,22.736134,...,22.629226,19.013674,17.831558,17.018316,21.837387,19.700255,19.084056,18.534690,20.787275,21.117423
1,2018,1,min,22.725760,21.007865,17.730792,18.045290,20.766734,18.656651,22.607481,...,21.163491,17.371653,17.194530,18.964190,17.892385,17.646139,19.844125,22.729859,19.768917,20.913443
2,2018,2,max,19.015120,19.261805,17.510713,21.080425,17.915749,19.082145,18.056023,...,21.254968,20.346324,20.036019,22.926773,17.533172,20.308927,20.438899,17.005806,18.346534,20.878165
3,2018,2,min,18.653843,22.818600,21.842673,21.958159,22.523078,18.535469,19.636158,...,19.711974,20.586232,18.780840,20.065633,18.293548,20.823661,18.056112,22.748292,22.470172,18.602007
4,2018,3,max,20.741115,19.704016,17.039811,20.703908,22.714125,17.205000,19.079503,...,19.528963,19.563689,22.658997,22.446357,17.911240,22.591993,17.406800,19.118712,22.767154,17.119452

The table having columns [year, month, day, min, max] is much more intuitive.

In [58]:
weather_melt = pd.melt(weather, id_vars=['year', 'month', 'element'], var_name="day", value_name="temp")
weather_melt.head()

   year  month element   day       temp
0  2018      1     max  day1  17.573016
1  2018      1     min  day1  22.725760
2  2018      2     max  day1  19.015120
3  2018      2     min  day1  18.653843
4  2018      3     max  day1  20.741115

In [70]:
weather_tidy = weather_melt.pivot_table(index=['year', 'month', 'day'], columns = 'element',values='temp', dropna=False).reset_index()

In [71]:
weather_tidy.head()

element  year  month    day        max        min
0        2018      1   day1  17.573016  22.725760
1        2018      1  day10  19.067288  19.931129
2        2018      1  day11  19.361002  22.598325
3        2018      1  day12  20.982134  17.715137
4        2018      1  day13  21.668005  17.940334

### Write csv files

In [ ]:
weather.to_csv('output/weather_tidy.csv', sep=",") # this will cause error if output folder is not there

You will have to create the output folder by yourself.

### Apply a function on mutiple columns or rows

What if I want to find the average minimum and maximum temperatures?

In [83]:
def mean_func(x):
    return sum(x)/len(x)

weather_temp = weather_tidy[['max','min']]

weather_temp.apply(mean_func, axis=0) # axis would be 0 because we want to collapse rows

element
max    20.213054
min    19.971738
dtype: float64

### Merge

In [85]:
users = pd.DataFrame({'id':[1, 2, 3], 'name':['A', 'B', 'C']})
msgs = pd.DataFrame({'userid':[1, 1, 2], 'msg':['hello', 'bye', 'hi']})
users.merge(msgs, left_on="id", right_on="userid") # this is inner join

   id name  userid    msg
0   1    A       1  hello
1   1    A       1    bye
2   2    B       2     hi